tests/Chisel.Tests/DependencyGraphTest.PollyGraphIgnoreGlob_includeLinks=True_format=graphviz.verified.gv
# Generated by https://github.com/0xced/Chisel

digraph
{
  rankdir=LR
  node [ fontname = "Segoe UI, sans-serif", shape = box, style = filled, fillcolor = aquamarine, color = "#009061", fontcolor = "#333333" ]

  "Microsoft.Bcl.TimeProvider/8.0.0" -> "Microsoft.Bcl.AsyncInterfaces/6.0.0"
  "NETStandard.Library/2.0.3" -> "Microsoft.NETCore.Platforms/1.1.0"
  "Polly/8.4.0" -> "Polly.Core/8.4.0"
  "Polly.Core/8.4.0" -> "Microsoft.Bcl.AsyncInterfaces/6.0.0"
  "Polly.Core/8.4.0" -> "Microsoft.Bcl.TimeProvider/8.0.0"

  "Microsoft.Bcl.AsyncInterfaces/6.0.0" [ href="https://www.nuget.org/packages/Microsoft.Bcl.AsyncInterfaces/6.0.0" ]
  "Microsoft.Bcl.TimeProvider/8.0.0" [ href="https://www.nuget.org/packages/Microsoft.Bcl.TimeProvider/8.0.0" ]
  "Microsoft.NETCore.Platforms/1.1.0" [ href="https://www.nuget.org/packages/Microsoft.NETCore.Platforms/1.1.0" ]
  "NETStandard.Library/2.0.3" [ shape = hexagon, penwidth = 4, href="https://www.nuget.org/packages/NETStandard.Library/2.0.3" ]
  "Polly/8.4.0" [ shape = hexagon, penwidth = 4, href="https://www.nuget.org/packages/Polly/8.4.0" ]
  "Polly.Core/8.4.0" [ href="https://www.nuget.org/packages/Polly.Core/8.4.0" ]
}
